# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce%20_schema.png](attachment:e_commerce%20_schema.png)

### Load Required Libraries

In [1]:
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [2]:
connection = mysql.connector.connect(host ="127.0.0.1",
                                     user ="root",
                                     passwd ="Damien_12")
cursorObject = connection.cursor()

### You are required to create a database named 'e_commerce'

In [3]:
query = "create database e_commerce"
cursorObject.execute(query)
connection.close()

In [3]:
connection = mysql.connector.connect(host ="127.0.0.1",
                                     user ="root",
                                     passwd ="Damien_12",
                                     database ="e_commerce")
cursorObject = connection.cursor()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [8]:
table_creation_query = """create table supplier(SUPP_ID int primary key, SUPP_NAME varchar(50),
                           SUPP_CITY varchar(50), SUPP_PHONE varchar(10));
                           
                           create table customer(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL,
                           CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));
                           
                           create table category (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,
                           PRIMARY KEY (CAT_ID));
                           
                           create table product (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL,
                           PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),
                           FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));
                           
                           create table product_details (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL,
                           SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL, PRIMARY KEY (PROD_ID),
                           FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));
                           
                           create table order(ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE,
                           CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),
                           FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));
                           
                           create table rating (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL,
                           RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),
                           FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID));"""

cursorObject.execute(table_creation_query)

InterfaceError: Use multi=True when executing multiple statements

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [18]:
insert_supplier_details = """insert into supplier(SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE)
                            values(%s, %s, %s, %s)"""
val = [(1, "Rajesh Retails", "Delhi", 1234567890),
       (2, "Appario Ltd.", "Mumbai", 2589631470),
       (3, "Knome products", "Bangalore", 9785462315),
       (4, "Bansal Retails", "Kochi", 8975463285),
       (5, "Mittal Ltd.", "Lucknow", 7898456532)]
cursorObject.executemany(insert_supplier_details, val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [21]:
insert_customer_details = """insert into customer(CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER)
                            values(%s, %s, %s, %s, %s)"""
val = [(1, "AAKASH", 9999999999, "DELHI", "M"),
       (2, "AMAN", 9785463215, "NOIDA", "M"),
       (3, "NEHA", 9999999998, "MUMBAI", "F"),
       (4, "MEGHA", 9994562399, "KOLKATA", "F"),
       (5, "PULKIT", 7895999999, "LUCKNOW", "M")]
cursorObject.executemany(insert_customer_details, val)
connection.commit()

IntegrityError: 1062 (23000): Duplicate entry '1' for key 'customer.PRIMARY'

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [22]:
insert_category_details = """insert into category(CAT_ID, CAT_NAME)
                            values(%s, %s)"""
val = [(1, "BOOKS"),
       (2, "GAMES"),
       (3, "GROCERIES"),
       (4, "ELECTRONICS"),
       (5, "CLOTHES")]
cursorObject.executemany(insert_category_details, val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [24]:
insert_product = """insert into product(PRO_ID, PRO_NAME, PRO_DESC, CAT_ID)
                            values(%s, %s, %s, %s)"""
val = [(1, "GTA V", "DFJDJFDJFDJFDJFJF", 2),
       (2, "TSHIRT", "DFDFJDFJDKFD", 5),
       (3, "ROG LAPTOP", "DFNTTNTNTERND", 4),
       (4, "OATS", "REURENTBTOTH", 3),
       (5, "HARRY POTTER", "NBEMCTHTJTH", 1)]
cursorObject.executemany(insert_product, val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [26]:
insert_product_details = """insert into product_details(PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE)
                            values(%s, %s, %s, %s)"""
val = [(1, 1, 2, 1500),
       (2, 3, 5, 30000),
       (3, 5, 1, 3000),
       (4, 2, 3, 2500),
       (5, 4, 1, 1000)]
cursorObject.executemany(insert_product_details, val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [29]:
insert_orders = """insert into orders(ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID)
                            values(%s, %s, %s, %s, %s)"""
val = [(20,1500,"2021-10-12",3,5),
       (25,30500,"2021-09-16",5,2),
       (26,2000,"2021-10-05",1,1),
       (30,3500,"2021-08-16",4,3),
       (50,2000,"2021-10-06",2,1)]
cursorObject.executemany(insert_orders, val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [30]:
insert_rating = """insert into rating(RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS)
                            values(%s, %s, %s, %s)"""
val = [(1, 2, 2, 4),
       (2, 3, 4, 3),
       (3, 5, 1, 5),
       (4, 1, 3, 2),
       (5, 4, 5, 4)]
cursorObject.executemany(insert_rating, val)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [7]:
question_3 = """select CUS_PHONE, CUS_GENDER from customer where CUS_ID in
                (select CUS_ID from orders where ORD_AMOUNT > 3000) group by CUS_PHONE, CUS_GENDER;"""

cursorObject.execute(question_3)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CUS_NUMBER','CUS_GENDER'])
output_df

   CUS_NUMBER CUS_GENDER
0  7895999999          M
1  9994562399          F

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [8]:
question_4 = """select orders.*, product.PRO_NAME
                from orders
                join product on orders.PROD_ID = product.PRO_ID
                where orders.CUS_ID = 2;"""

cursorObject.execute(question_4)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID','PRO_NAME'])
output_df

   ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID PRO_NAME
0      50        2000  2021-10-06       2        1    GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [9]:
question_5 = """SELECT supplier.*
                FROM supplier
                WHERE supplier.SUPP_ID IN (
                SELECT SUPP_ID
                FROM product_details
                GROUP BY SUPP_ID
                HAVING COUNT(DISTINCT PROD_ID) > 1);"""

cursorObject.execute(question_5)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE'])
output_df

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [10]:
question_6 = """select CAT_NAME from category C join
                product P on C.CAT_ID = P.CAT_ID join
                orders O on P.PRO_ID = O.PROD_ID where 
                O.ORD_AMOUNT =(select min(ORD_AMOUNT) from orders);"""

cursorObject.execute(question_6)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CAT_NAME'])
output_df

  CAT_NAME
0    BOOKS

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [6]:
question_7 = """select P.PRO_ID, P.PRO_NAME from product P join
                orders O on P.PRO_ID = O.PROD_ID where 
                O.ORD_DATE > '2021-10-05';"""

cursorObject.execute(question_7)
output = cursorObject.fetchall()


output_df = pd.DataFrame(output, columns=['PRO_ID','PRO_NAME'])
output_df

   PRO_ID      PRO_NAME
0       5  HARRY POTTER
1       1         GTA V

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [32]:
question_8= """select supplier.supp_id,supplier.supp_name,customer.cus_name,rating.rat_ratstars 
               from rating inner join supplier on rating.supp_id=supplier.supp_id 
               inner join customer on rating.cus_id=customer.cus_id order by rating.rat_ratstars desc limit 3;"""

cursorObject.execute(question_8)
output = cursorObject.fetchall()


output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','CUS_NAME','RAT_RATSTARS'])
output_df

   SUPP_ID       SUPP_NAME CUS_NAME  RAT_RATSTARS
0        1  Rajesh Retails   PULKIT             5
1        2    Appario Ltd.     AMAN             4
2        5     Mittal Ltd.    MEGHA             4

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [11]:
question_9 = """select CUS_NAME, CUS_GENDER from customer where CUS_NAME like 'A%' or CUS_NAME like '%A';"""

cursorObject.execute(question_9)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CUS_ID','CUS_GENDER'])
output_df

   CUS_ID CUS_GENDER
0  AAKASH          M
1    AMAN          M
2    NEHA          F
3   MEGHA          F

### Q10) Display the total order amount of the male customers.

In [31]:
question_10=     """select sum(`orders`.ord_amount) as Amount 
                from `orders` inner join customer on `orders`.cus_id=customer.cus_id where customer.cus_gender='M';"""

cursorObject.execute(question_10)
output = cursorObject.fetchall()


print("Amount is",output);

Amount is [(Decimal('34500'),)]

### Q11) Display all the Customers left outer join with  the orders

In [12]:
question_11 = """select *  from customer C
LEFT JOIN orders o ON c.cus_id = o.cus_id"""

cursorObject.execute(question_11)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CUS_ID','CUS_NAME','CUS_PHONE','CUS_CITY','CUS_GENDER','ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID'])
output_df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,3,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,4,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,5,2

In [13]:
connection.close()

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)